{"[PAD]": 0, "[UNK]": 1, "[CLS]": 2, "[WHITE]": 3, "[BLACK]": 4, "Rd1+": 5, "Rf8+": 6, "Re1": 7, "Bxh6+": 8, "Rdc7": 9, "Ba2": 10, "Rb7+": 11, "Rff5": 12, "Reg8": 13, "Qxh6+": 14, "N5g6": 15, "Nxg3": 16, "Re7#": 17, "Ra6+": 18, "R8d7": 19, "Qxg8+": 20, "Nxg3+": 21, "Kc6": 22, "b7": 23, "e2+": 24, "Rdc1": 25, "Kxd8": 26, "Qc6": 27, "exf4": 28, "Nab3": 29, "Qfe2+": 30, "h6": 31, "Qxf4+": 32, "Rxd8": 33, "Ra1+": 34, "Rxd1": 35, "Qxh7": 36, "Ng5": 37, "Rfe1": 38, "Qxg5+": 39, "Bg7": 40, "fxg3": 41, "d8=Q": 42, "Rhg8": 43, "Nd2+": 44, "Be8": 45, "Bd8": 46, "Qxc2": 47, "e6+": 48, "axb2": 49, "Nfxe5": 50, "Nxc8": 51, "Rxd7+": 52, "Bxd4": 53, "Rdd1": 54, "Qa6": 55, "Nxh5+": 56, "Kc1": 57, "R8h6": 58, "Rxf1#": 59, "Kxd2": 60, "R1b7+": 61, "Nf7+": 62, "Qe5+": 63, "Qxd2": 64, "Kxf6": 65, "Kxe2": 66, "Kxd3": 67, "Nc3": 68, "Qxb4+": 69, "Nb5": 70, "e7": 71, "Nbd2": 72, "Bxd5": 73, "Ra7": 74, "Rgf8": 75, "Nfe7": 76, "Bd7+": 77, "d8=Q+": 78, "Qg1+": 79, "Nxb4": 80, "Qc6+": 81, "R5f6": 82, "g1=Q+": 83, "Nce5": 84, "Nf6": 85, "Ke8": 86, "Rfxe3": 87, "Kxf2": 88, "Bxg8": 89, "Kxc8": 90, "Nce7": 91, "Qxb2+": 92, "Na1": 93, "Rxc7+": 94, "Bxb7+": 95, "R1xe4": 96, "Ngf4": 97, "Qxa5": 98, "Bxg5": 99, "R1xe2": 100, "Bxh3+": 101, "Rcc8": 102, "Na3": 103, "R8f6": 104, "Bxe5+": 105, "f1=Q": 106, "fxg6+": 107, "cxb4": 108, "Qxa8": 109, "Bxe2": 110, "R1d3": 111, "Rf3": 112, "h3": 113, "Qxd7": 114, "Qb5+": 115, "Rhxd3": 116, "Qxg3": 117, "Rfb8": 118, "Bxf5": 119, "Ka5": 120, "Rcd4": 121, "Nd3+": 122, "Qe8+": 123, "Rdf1": 124, "Qb6+": 125, "Rd4": 126, "Bb3+": 127, "Qxg1": 128, "bxc4": 129, "Rfe3": 130, "Ndxc5": 131, "Kxe1": 132, "Ne3": 133, "Rcf3": 134, "Rbd5": 135, "Kxf1": 136, "Rbe2": 137, "N1e2": 138, "R1c5": 139, "Ke2": 140, "Ree5": 141, "Qxh1+": 142, "Bb8+": 143, "Kxb5": 144, "Rxa8": 145, "Qxf8+": 146, "Rxf3+": 147, "Rc3+": 148, "Rae8": 149, "Qg4": 150, "Kf5+": 151, "Qb8+": 152, "Ndf6": 153, "h8=Q": 154, "Bxh3": 155, "Rc7": 156, "Rxc1+": 157, "Qa8": 158, "Bxc2": 159, "Bxd6": 160, "fxe5+": 161, "f2+": 162, "Rxg7+": 163, "cxd3+": 164, "Rh2": 165, "R8b6": 166, "Bg4+": 167, "Rxb3": 168, "Ne6+": 169, "Qxg2#": 170, "Qxc1": 171, "Nfh5": 172, "Nd8+": 173, "Nde3": 174, "Rfg1": 175, "Qe6": 176, "Qxd2+": 177, "exf5+": 178, "Rxe2+": 179, "Nac5": 180, "Nfg5": 181, "Nca8": 182, "Bxf8": 183, "Qb8": 184, "Rd4+": 185, "Qxa1+": 186, "Kd6": 187, "Nba5": 188, "Qa4": 189, "Qe1#": 190, "cxd4": 191, "Nb6+": 192, "Qe8": 193, "Nb3+": 194, "Rbf8": 195, "Qa8#": 196, "a3": 197, "Qxe3+": 198, "bxc6": 199, "Bxg4+": 200, "Nxa6": 201, "Rxe8+": 202, "bxc5+": 203, "Qxa3#": 204, "Bxf6": 205, "bxc7": 206, "Nbd4": 207, "Qc3+": 208, "Kf4+": 209, "O-O": 210, "Nef6": 211, "Qe4#": 212, "Nxg6+": 213, "hxg4+": 214, "Bh1": 215, "Ba1": 216, "Rd2+": 217, "Reg1": 218, "Rxf5+": 219, "Nf1+": 220, "Nxd7+": 221, "Bh2+": 222, "b6#": 223, "Rxf2+": 224, "Qxa7": 225, "cxd5": 226, "Rxe6": 227, "Kxc6": 228, "Rbxc8": 229, "f8=Q": 230, "Rbe8": 231, "Rxc6": 232, "Rac2": 233, "Be8+": 234, "Raxf3": 235, "R1g2": 236, "Qc1": 237, "Rcf1": 238, "Qgg7": 239, "Nxb1": 240, "N8d7": 241, "Kb7": 242, "Rad2": 243, "Nc8+": 244, "gxf5+": 245, "Ka8": 246, "Re1#": 247, "Qce6+": 248, "Rxg2": 249, "Rag7+": 250, "N1g2": 251, "Rxe8": 252, "Ncd5+": 253, "Ra3+": 254, "Rh8": 255, "Bxc5+": 256, "Ncd4": 257, "Bc4+": 258, "Bh2": 259, "Bh6": 260, "Raxd8": 261, "Rcg3": 262, "Raa8": 263, "Kxh3": 264, "Rbxc3": 265, "Rxd8+": 266, "Qg5+": 267, "Bxg6+": 268, "Rfxd1": 269, "R7b5+": 270, "Qc8#": 271, "Re8": 272, "Rxb4+": 273, "Rxd2+": 274, "N5b6": 275, "Qxh5": 276, "Nbxc4": 277, "g5": 278, "bxa5": 279, "Be4": 280, "Bxb6": 281, "Qg2": 282, "Rb3+": 283, "gxf3": 284, "bxa3": 285, "Bxf2": 286, "Bd1+": 287, "Nxb8": 288, "Rea8": 289, "Qh2#": 290, "Rec8": 291, "Nexd4": 292, "Nxd1": 293, "Nfxe4": 294, "Qf4#": 295, "Rxa2": 296, "Kxb4": 297, "Kxg1": 298, "Rgd3": 299, "g4": 300, "Nec3": 301, "Kxa4": 302, "Rge3": 303, "Qh7": 304, "Reg2": 305, "Rh1#": 306, "g4+": 307, "Rxh8": 308, "R1e2": 309, "Kd1": 310, "Rgb2": 311, "Rce7": 312, "Re7+": 313, "Nxf1": 314, "Ng2": 315, "Nexf2": 316, "Be5": 317, "Bc1": 318, "Rff2": 319, "Kh4": 320, "exf5": 321, "axb5": 322, "dxe4+": 323, "Ne4#": 324, "Na6": 325, "Qg3+": 326, "Qe6+": 327, "Qf7+": 328, "dxe7": 329, "Kxa1": 330, "e6": 331, "Ndb5": 332, "Ne6": 333, "e2": 334, "Qxf4": 335, "Kh7": 336, "Rxa5+": 337, "Qf3": 338, "Rbc8": 339, "Nc7": 340, "bxc3": 341, "Kxf3": 342, "d2+": 343, "N3h4": 344, "Nxd6+": 345, "Nf1": 346, "Rfd2": 347, "a7": 348, "Ke6+": 349, "Kxh6": 350, "Bc6+": 351, "Qxc8": 352, "d5+": 353, "Bh6+": 354, "R5b4": 355, "Bxf1": 356, "Bxc8": 357, "Nxe8+": 358, "fxe4+": 359, "Qxa6": 360, "Rgh7": 361, "Rcd7": 362, "Nh1": 363, "Rxc1": 364, "Rf7": 365, "axb6+": 366, "Kg8": 367, "Rd3": 368, "Nxf3": 369, "Nxe3+": 370, "Bh3+": 371, "Bd3": 372, "Kxc5": 373, "Rda1": 374, "f7#": 375, "Qb8#": 376, "Ngh5": 377, "Qa3+": 378, "Ng5+": 379, "Rgh3": 380, "Reg5": 381, "Nxf5+": 382, "Rxc8": 383, "Nac3": 384, "Bxe4+": 385, "axb4": 386, "Bxa7": 387, "Rf6+": 388, "Rdc2": 389, "Qxc8+": 390, "Re8+": 391, "Bxf3": 392, "Rf5": 393, "Qbd7+": 394, "Bg5": 395, "Qd8#": 396, "Rxd3+": 397, "Rb1": 398, "Nxd2+": 399, "Re2": 400, "Rcc1": 401, "Nh5+": 402, "R5e6": 403, "Qxh7#": 404, "Rdg1": 405, "Ree3": 406, "Rg1+": 407, "Nf4+": 408, "R8f5+": 409, "Qf7": 410, "Bxe3": 411, "Rc6": 412, "Bc5": 413, "e3": 414, "Qxf3": 415, "fxg6": 416, "Kxg5": 417, "Nge5": 418, "Ngf7": 419, "Bf5": 420, "Rb8": 421, "Nbxd4": 422, "Nfxd4": 423, "Rgf6": 424, "Bc8": 425, "Nxb6+": 426, "fxe5": 427, "Rxa4": 428, "Qxa3": 429, "Nef1": 430, "Rec6": 431, "Ba3": 432, "Bxb1": 433, "b4": 434, "Nxf6": 435, "Rdb7": 436, "Qh3": 437, "Rfxd8": 438, "Rgg1": 439, "Nf7": 440, "Ne2": 441, "Nh2": 442, "Nfd8": 443, "Rbxb2": 444, "Ka7": 445, "Rxf3": 446, "Ng4+": 447, "cxb5": 448, "Ne3+": 449, "Rgg6": 450, "Bxc3": 451, "Rfxf2": 452, "Nab8": 453, "Bxb7": 454, "Ra2+": 455, "Nc6+": 456, "Qd8": 457, "Qg6+": 458, "axb7": 459, "Rhd1": 460, "Rcd8": 461, "Qxa6+": 462, "Nf8+": 463, "Rb2+": 464, "c1=Q": 465, "R8e7": 466, "Kb1": 467, "Qa1": 468, "Qf5+": 469, "Bxd4+": 470, "Rg5+": 471, "Rah1": 472, "Qa2": 473, "hxg4": 474, "Ne4": 475, "Nce4": 476, "Qg1#": 477, "Rexe5": 478, "Nxb4+": 479, "R8f7": 480, "Kxh5": 481, "Rf4": 482, "Nxc8+": 483, "cxd3": 484, "Bg2": 485, "Rae8+": 486, "Kxg4": 487, "Ba7": 488, "Rac1": 489, "Rg6": 490, "Rcf2": 491, "Bxh1": 492, "Ra1": 493, "Rb6+": 494, "Bb3": 495, "e8=Q+": 496, "Rad6": 497, "R8f2#": 498, "h2+": 499, "Nd5+": 500, "exd4+": 501, "Nxh3+": 502, "Nxc7": 503, "exd5": 504, "Rcxc7": 505, "R7h5": 506, "Qh8": 507, "Ne8+": 508, "Rxh5+": 509, "Rxa1": 510, "Rfa2": 511, "Rb3": 512, "Rce2": 513, "h7": 514, "exd5+": 515, "Ndc3": 516, "Bd3+": 517, "Ba6+": 518, "Rg3": 519, "Rxg5+": 520, "b4+": 521, "Qe1+": 522, "Nde2": 523, "Qe7": 524, "Qb2+": 525, "Rxg1": 526, "Bb8": 527, "Kb8": 528, "Qxf7+": 529, "Ncxe2": 530, "Nh3": 531, "Rfd1": 532, "Qa7+": 533, "Kxf8": 534, "Rxe5+": 535, "Raxc1": 536, "Qd1+": 537, "Bxb2+": 538, "Raa1": 539, "Rhc5": 540, "Rf2": 541, "Qd7": 542, "Qbh8#": 543, "Rxh3+": 544, "b5+": 545, "Bd7": 546, "R4d3": 547, "Qh4#": 548, "Qxd8": 549, "Nc5+": 550, "R1a3": 551, "Nf6+": 552, "Bxh8": 553, "gxh5+": 554, "Nd1+": 555, "Qa1+": 556, "Qc3": 557, "Bxf5+": 558, "e1=Q+": 559, "Qxg5": 560, "Rgxf4+": 561, "Rh1+": 562, "d5": 563, "R8b3": 564, "Qd2#": 565, "Rde3": 566, "Qb6": 567, "Qxd8+": 568, "cxb2": 569, "Qb4+": 570, "Qg7": 571, "g4#": 572, "R2h7+": 573, "Rhf8": 574, "axb4+": 575, "Nxf7+": 576, "Rha1": 577, "Qe4": 578, "Nd4": 579, "Rb7": 580, "N8c6": 581, "cxd6": 582, "Nac7": 583, "Qh1": 584, "Nbxd5": 585, "Qd3+": 586, "Bxg2": 587, "Rxg8+": 588, "Nc3+": 589, "R4e2": 590, "Qd7+": 591, "Bb2": 592, "Ree1": 593, "a5": 594, "Bh3": 595, "Qxa1": 596, "Bd5": 597, "Ref2": 598, "R4e5": 599, "Kxf4": 600, "fxe2": 601, "Ndxb5": 602, "Qxd6": 603, "Nxh6": 604, "Nxc3+": 605, "dxe5": 606, "Bxc4+": 607, "Re1+": 608, "Kc3": 609, "Rb4": 610, "Kf8": 611, "Qe3+": 612, "Nxd2": 613, "Rxf4+": 614, "Rea3": 615, "Nef3": 616, "Qcb5": 617, "Nxh2": 618, "Be7+": 619, "Rdxd5": 620, "bxc5": 621, "Nxc7+": 622, "exd2": 623, "Rxd7": 624, "Nf5": 625, "Qb2": 626, "Rfe8+": 627, "Rxg4": 628, "bxc2": 629, "Kg2": 630, "Qxh2": 631, "exf6+": 632, "Qxa5+": 633, "Qfd4+": 634, "Qhh5": 635, "R2c6": 636, "Ng6+": 637, "Qc2+": 638, "Rd5+": 639, "Raf8": 640, "Rde7": 641, "Ne5": 642, "Rxf6+": 643, "exf4+": 644, "Nxa7+": 645, "Ra8": 646, "Nxg2": 647, "Na6+": 648, "Qb4": 649, "Nxb2": 650, "Qxd1": 651, "Rg2+": 652, "d1=Q+": 653, "Qc1#": 654, "Rae5": 655, "Kxc3": 656, "Rxf1": 657, "Ndxf5": 658, "Rxg8": 659, "Nxf3+": 660, "h3+": 661, "Kxe8": 662, "Qxb6": 663, "Qxc6+": 664, "Qf5": 665, "Rhxg5": 666, "Bxh2": 667, "a8=Q": 668, "Qxa8+": 669, "Kb4": 670, "Ngf8": 671, "Qg7#": 672, "Nxb6": 673, "Bxc6+": 674, "Kxh4": 675, "Nxd3": 676, "gxf3+": 677, "b1=Q+": 678, "Qd4": 679, "Qda5": 680, "Qc7": 681, "N5xa4": 682, "Rxb8": 683, "Rxh4+": 684, "R4e3": 685, "Nge4": 686, "R8d4": 687, "Rc5": 688, "Rgxg4": 689, "Be6+": 690, "hxg3+": 691, "R8c7": 692, "Qee5+": 693, "Rxg3+": 694, "Ndb4": 695, "Ndf7": 696, "exf3": 697, "Qh1#": 698, "Nb7+": 699, "Ba5": 700, "Qd3": 701, "Qxg6": 702, "f4+": 703, "Ncxb5": 704, "Re7": 705, "Rhf3": 706, "Rdd3": 707, "N1d2": 708, "Kd2": 709, "c4": 710, "Nxg4+": 711, "Nxa2+": 712, "Bxd3+": 713, "Qc4": 714, "Rec1": 715, "Ne7+": 716, "Rxg5": 717, "Bc3+": 718, "R4e6": 719, "Qxf7": 720, "Bf4+": 721, "Ba4+": 722, "Ndf8": 723, "Rbb8": 724, "Nxf2#": 725, "f3+": 726, "Bxd7": 727, "g8=Q": 728, "Rxa3+": 729, "Rg4#": 730, "R2f6": 731, "b7+": 732, "Rxa2+": 733, "Bxg2+": 734, "axb3": 735, "c4+": 736, "Nde5": 737, "Rg4+": 738, "Rcd1": 739, "Ng3": 740, "R5h3": 741, "Qd2": 742, "Rf2+": 743, "Bxd3": 744, "Qxe7+": 745, "Qxg4+": 746, "Bc2": 747, "Nbc6": 748, "R6f7": 749, "Na4": 750, "Qxf6+": 751, "Rc7+": 752, "Qxb3": 753, "Rch7": 754, "Qh6+": 755, "g3+": 756, "Ka3": 757, "Rh6": 758, "Qxf8": 759, "Qxg7#": 760, "Qxb1": 761, "e3+": 762, "dxc5+": 763, "Rxe7": 764, "Rxb8+": 765, "Nd2": 766, "Nb7": 767, "Red3": 768, "Qxf5": 769, "Rdf8": 770, "Nxe8": 771, "Ka6": 772, "Qh7+": 773, "Qxd6+": 774, "Kh8": 775, "Rbh2": 776, "Nxc1": 777, "R4f2": 778, "fxg5+": 779, "Nc2": 780, "Nxa5": 781, "Kd7": 782, "c1=Q+": 783, "Rg6+": 784, "Rxc4": 785, "e5": 786, "fxg7+": 787, "Nbc3": 788, "Rfb3": 789, "fxe6": 790, "Ned4": 791, "Ng7": 792, "Kf7": 793, "Kxe3": 794, "Bxe4": 795, "Nge2": 796, "Nef4": 797, "Qxb5": 798, "Nhf1": 799, "Nxe4+": 800, "hxg3": 801, "Qxf5+": 802, "Qxh8": 803, "Rxe1+": 804, "Rxe5": 805, "Bf6": 806, "Bxa1": 807, "Re5+": 808, "Bxb2": 809, "Rh8#": 810, "Qd8+": 811, "Nxc4": 812, "Rxh1": 813, "Nfe8": 814, "Nxe7+": 815, "Rad7": 816, "Qa7": 817, "O-O-O": 818, "Bxh6": 819, "Qff6": 820, "Nbc2": 821, "Rea2": 822, "Nxf2": 823, "Reb8": 824, "Rcxb5": 825, "Kxd4": 826, "R2b6": 827, "Qdh8#": 828, "Rgxf5": 829, "Kd3": 830, "Rcg1": 831, "Nxf4+": 832, "Qxe2": 833, "Na3+": 834, "hxg5": 835, "Bxe6+": 836, "Qd6+": 837, "Bxf4": 838, "h5+": 839, "Be6": 840, "Kxe4": 841, "h1=Q": 842, "Rxb5": 843, "Nbd6": 844, "Nxd6": 845, "Qxa4": 846, "Nxc2+": 847, "Nde7": 848, "Nxh6+": 849, "Rge7": 850, "Qh2": 851, "f7": 852, "Rxh6+": 853, "exd4": 854, "Rea1": 855, "axb2+": 856, "Qdd4#": 857, "Kxg8": 858, "exf1=Q+": 859, "Bxb5": 860, "Nxg5": 861, "Bxg4": 862, "Nhf6": 863, "a6": 864, "g5+": 865, "Qd2+": 866, "R4g2+": 867, "Rbe6": 868, "Rxb5+": 869, "a6+": 870, "Rexe3": 871, "Rhe8": 872, "Qxg5#": 873, "Rdxf7+": 874, "Qd5": 875, "Nd6": 876, "R1f2": 877, "Qxa3+": 878, "Nxe2": 879, "Bg7+": 880, "Qxf3+": 881, "Bxf7+": 882, "Rxe3": 883, "N2f3": 884, "Ncd5": 885, "Bc2+": 886, "Kh3": 887, "Rxe2#": 888, "fxe7": 889, "Bf6+": 890, "Rxc3": 891, "Nd7": 892, "Rfxf2+": 893, "d6+": 894, "Qf8": 895, "Nfd4": 896, "Ncb4": 897, "Rxb1": 898, "Ra7+": 899, "Rxf8": 900, "Ng3+": 901, "bxc4+": 902, "Rxc5": 903, "a2": 904, "Bxf6+": 905, "Ncd7": 906, "Rhc1": 907, "Rh7": 908, "Rxe3+": 909, "Qxh3+": 910, "Bxc2+": 911, "Bxa4": 912, "Ng4": 913, "N7b6": 914, "Nce2": 915, "Nxh4+": 916, "g8=Q+": 917, "Qc1+": 918, "Ree2": 919, "Raf1": 920, "e4": 921, "Qxc4+": 922, "Nb4": 923, "Nxe1": 924, "Rbd8": 925, "Qh2+": 926, "gxh4+": 927, "Qf1#": 928, "Rhg4+": 929, "Bg3": 930, "Bd5+": 931, "f6": 932, "Qg4#": 933, "Nac2": 934, "h8=Q+": 935, "Bd6": 936, "Nxg7+": 937, "Rec3": 938, "Nb6": 939, "Nxe5": 940, "Rfe8": 941, "Nxc4+": 942, "Qg8+": 943, "Nhg6": 944, "Rdd4": 945, "Bc7": 946, "Rah8": 947, "Kc4": 948, "b5": 949, "Rfxe1": 950, "c2": 951, "Qxc6": 952, "Qd4+": 953, "Qxe7": 954, "axb5+": 955, "Bxh5": 956, "Rdc4": 957, "Rd8": 958, "Rh4": 959, "Bxc4": 960, "Bxh7+": 961, "Ned5+": 962, "Qxe8": 963, "Bf3+": 964, "Bf2": 965, "b1=Q": 966, "Rxe1": 967, "Qhh8+": 968, "Bxb4": 969, "Na5": 970, "Nxf5": 971, "Rdd5": 972, "Qf4+": 973, "Qa2+": 974, "Ndb3": 975, "Qc2#": 976, "Rxd2": 977, "Rfg7": 978, "e5+": 979, "Bxb4+": 980, "Rfe4": 981, "Qf8#": 982, "Nxd4": 983, "Bxc5": 984, "Qg7+": 985, "Nxg4": 986, "Qxc5+": 987, "b8=Q+": 988, "Rxc7": 989, "Ke3": 990, "N2e4": 991, "c8=Q": 992, "Nxb3": 993, "Rxg6+": 994, "bxa5+": 995, "Bxe7+": 996, "Ng8": 997, "Rxd6": 998, "Rag1": 999, "Rxf2": 1000, "Rd3+": 1001, "Rbb5": 1002, "Bh7": 1003, "Bxg3": 1004, "dxe3": 1005, "Ncxd4": 1006, "Qc2": 1007, "Qa6+": 1008, "Nbxd2": 1009, "Bxf7": 1010, "Rde1": 1011, "Re6+": 1012, "Rhg1+": 1013, "Qf3+": 1014, "Nxd3+": 1015, "Rb8+": 1016, "Rh3": 1017, "hxg7+": 1018, "Bb6": 1019, "Bb4": 1020, "Kxg2": 1021, "Rh8+": 1022, "Bxc1": 1023, "Qf7#": 1024, "Rfh7": 1025, "Nfd3": 1026, "Rg8": 1027, "Nxa8": 1028, "a8=Q+": 1029, "Rag8": 1030, "Bxd6+": 1031, "Nxb7+": 1032, "Be5+": 1033, "Rfxe8": 1034, "Rbc5": 1035, "Nbxc5": 1036, "Bc5+": 1037, "Qxh8+": 1038, "Nxa4+": 1039, "gxf4": 1040, "Re8#": 1041, "R2d4": 1042, "Nxg5+": 1043, "Bxf3+": 1044, "Nxb2+": 1045, "bxa4+": 1046, "Rab8": 1047, "Rxd5+": 1048, "Rdh1": 1049, "Qf2#": 1050, "Rgh1": 1051, "g8=Q#": 1052, "Qf1+": 1053, "Rxh8+": 1054, "Qag8#": 1055, "Rgd8": 1056, "Re5": 1057, "O-O-O+": 1058, "Nxd5+": 1059, "f5": 1060, "Qxd3+": 1061, "Qc3#": 1062, "Nce6+": 1063, "Kxb1": 1064, "gxh3+": 1065, "Ra5#": 1066, "Nd3": 1067, "Nfe5": 1068, "Rxd6+": 1069, "Be4+": 1070, "Bc4": 1071, "Bxd2": 1072, "Nd7+": 1073, "d3+": 1074, "Qh8+": 1075, "Rg8+": 1076, "Bg8+": 1077, "Nd6+": 1078, "Rg1#": 1079, "d4+": 1080, "Rd5": 1081, "R6h5": 1082, "g2": 1083, "Nexd5": 1084, "Rcc2": 1085, "Rec7": 1086, "b2": 1087, "Qxe8+": 1088, "Rc4+": 1089, "Bxb5+": 1090, "Rfd7": 1091, "Nbd7": 1092, "Kxg3": 1093, "Rfe5": 1094, "Nxb5": 1095, "Ke5": 1096, "Qxb1+": 1097, "R4h7": 1098, "Qh1+": 1099, "Qb3": 1100, "Rae2": 1101, "Rgxg2": 1102, "Rgf1": 1103, "Qxh4": 1104, "R1c2": 1105, "Rxa7+": 1106, "Rb5+": 1107, "R6d4": 1108, "Rb6": 1109, "Nb1": 1110, "cxd7": 1111, "Be2": 1112, "Ned1": 1113, "Rhf8+": 1114, "Qxa2+": 1115, "Rd6": 1116, "Ra3": 1117, "Qf6+": 1118, "h2": 1119, "N1c3": 1120, "Qxg7+": 1121, "Bg2+": 1122, "c5": 1123, "Rxh1+": 1124, "Bxd7+": 1125, "Rxg4+": 1126, "Kd5+": 1127, "Qh6": 1128, "Rbxb6": 1129, "Kh1": 1130, "Bxc6": 1131, "Rc6+": 1132, "Bxe8": 1133, "Qh5#": 1134, "Qb1": 1135, "g2+": 1136, "Rfc8": 1137, "Qxh6": 1138, "Rd7+": 1139, "Nb5+": 1140, "Bg4": 1141, "Rc5+": 1142, "Qe1": 1143, "Rxd1+": 1144, "Bxd5+": 1145, "f6+": 1146, "Bg6": 1147, "e4+": 1148, "Qxc3": 1149, "Qxg2": 1150, "dxc4": 1151, "Nxa2": 1152, "Rcc7": 1153, "Raa2": 1154, "Ba8": 1155, "Ng7+": 1156, "Rhb1": 1157, "Rf8": 1158, "Rge8": 1159, "Rcb8": 1160, "N1xe2": 1161, "Kxe6": 1162, "Rfd6": 1163, "Rhg1": 1164, "gxh3": 1165, "d3": 1166, "gxf6": 1167, "Rc2+": 1168, "Rdd2": 1169, "Rae1": 1170, "Rdd8": 1171, "Qcd3#": 1172, "Ne7": 1173, "Nxh1": 1174, "Qxb4": 1175, "Re3+": 1176, "Nxa4": 1177, "Nxh5": 1178, "d1=Q": 1179, "Rxd5": 1180, "Qxb8+": 1181, "R5c3": 1182, "Bxh4": 1183, "Nh7+": 1184, "Ngxe4": 1185, "Qc4+": 1186, "Bxb3": 1187, "h4": 1188, "Rh5+": 1189, "Bg5+": 1190, "Raf2": 1191, "Rbd8+": 1192, "Rcb3": 1193, "Rxe7+": 1194, "Qxe6": 1195, "Ra6": 1196, "Bc6": 1197, "exf7+": 1198, "Nf2+": 1199, "Rbf1": 1200, "Qh5": 1201, "Nxf6+": 1202, "Rcxg2+": 1203, "R7e5": 1204, "Rgc8": 1205, "Kxb8": 1206, "Rexf5": 1207, "R7e6": 1208, "bxa4": 1209, "Ba2+": 1210, "Ree6": 1211, "Rxb7+": 1212, "Bxb8": 1213, "Rxe4+": 1214, "Nca4": 1215, "Rxa3": 1216, "Rd2": 1217, "Kxh1": 1218, "Ncxe5": 1219, "Be2+": 1220, "R1e7+": 1221, "Rxc4+": 1222, "hxg6+": 1223, "Kh2": 1224, "c3": 1225, "Nxc6+": 1226, "Qd6": 1227, "Qxd1+": 1228, "Rb5": 1229, "Ncxe4": 1230, "Qg3": 1231, "Qg4+": 1232, "Rc1+": 1233, "Rxa5": 1234, "Qc8": 1235, "dxc5": 1236, "cxb4+": 1237, "Ncb5": 1238, "Nc1": 1239, "Ngxe3": 1240, "N4c6": 1241, "gxh2+": 1242, "Nb3": 1243, "Rd6+": 1244, "h6+": 1245, "Rhf2": 1246, "Ncd2": 1247, "Kf1": 1248, "Nfd5": 1249, "Nxf7": 1250, "Rg5": 1251, "Kg1": 1252, "Na2": 1253, "Rxb1+": 1254, "Nac8": 1255, "Nxe6": 1256, "Rf1": 1257, "Rcxd2": 1258, "Bxg7": 1259, "Bf1": 1260, "Bg1": 1261, "Nxe4": 1262, "Kb5": 1263, "Qe7+": 1264, "Kxh7": 1265, "Bd8+": 1266, "Ne1": 1267, "Rgg7": 1268, "Nb2+": 1269, "Ke1": 1270, "Qg1": 1271, "Bxg1": 1272, "Nh6": 1273, "Rcg8": 1274, "Nxc2": 1275, "Qf8+": 1276, "Kxb7": 1277, "Nde6": 1278, "Qxb7": 1279, "Qxg3#": 1280, "Nh4+": 1281, "Bxc3+": 1282, "Kxa5": 1283, "Rde8": 1284, "Rbc4": 1285, "h5": 1286, "Ndb6": 1287, "N5c6": 1288, "Bd2": 1289, "Ngxe5": 1290, "Rf5+": 1291, "Nxe7": 1292, "R3xg5": 1293, "Qxh4+": 1294, "Qf2": 1295, "Rdg8": 1296, "Nxf8": 1297, "Nxc6": 1298, "Bh8": 1299, "R1d2": 1300, "Rxd4": 1301, "Rxg7": 1302, "Qe2": 1303, "Bxa8": 1304, "Qxg4": 1305, "Rxa3#": 1306, "Qxf6": 1307, "Qxe2+": 1308, "Rf1#": 1309, "Rbb1": 1310, "Qxh1": 1311, "Rgg5": 1312, "fxg5": 1313, "Qxd5+": 1314, "b3": 1315, "Qg8": 1316, "Qxb2": 1317, "Rxc8+": 1318, "Qh5+": 1319, "Qxh7+": 1320, "Rdd7": 1321, "Nxg6": 1322, "Qxd4+": 1323, "Bb4+": 1324, "Qh4": 1325, "Na8": 1326, "Nge6": 1327, "Kxb6": 1328, "Ref1": 1329, "fxg4+": 1330, "Qxe4+": 1331, "Reb1": 1332, "Qxd4": 1333, "Rxb6+": 1334, "Ke6": 1335, "Nxb7": 1336, "Rff1": 1337, "f1=Q+": 1338, "f7+": 1339, "Bh4+": 1340, "Kxg7": 1341, "Ndc6": 1342, "Rhf1": 1343, "Qxf2": 1344, "Nef5": 1345, "Rhe7": 1346, "Kxc7": 1347, "Rxe4": 1348, "dxc6": 1349, "Nfe4": 1350, "dxe5+": 1351, "gxf6+": 1352, "Rc8+": 1353, "Rdb8": 1354, "Rhe1": 1355, "Ree7": 1356, "Nxc1+": 1357, "Kxg6": 1358, "Kxe5": 1359, "hxg6": 1360, "Ra4+": 1361, "Raa7": 1362, "Rxb2": 1363, "Rfg7+": 1364, "Kg4": 1365, "b4#": 1366, "Bb5": 1367, "Bf8+": 1368, "Qb1+": 1369, "Rxf6": 1370, "Nde2+": 1371, "Rfc1": 1372, "Qxe1+": 1373, "Rbd1": 1374, "a5+": 1375, "hxg3#": 1376, "Qg6#": 1377, "Kxa3": 1378, "Kf2": 1379, "f5+": 1380, "Bf7#": 1381, "Ba6": 1382, "Qxf1+": 1383, "cxb7": 1384, "Rc4": 1385, "Bxe6": 1386, "Rxa7": 1387, "Q1a2#": 1388, "Rxc3+": 1389, "Rdc8": 1390, "Bxa2": 1391, "Na7": 1392, "Bf8": 1393, "Kc5": 1394, "cxb3": 1395, "Kh5": 1396, "c7": 1397, "Kb6": 1398, "d2": 1399, "Kxd7": 1400, "Ned3": 1401, "Kb3": 1402, "R5c7": 1403, "Qxf1": 1404, "c5+": 1405, "Rxa1+": 1406, "Neg5+": 1407, "N4a6": 1408, "Nxh7": 1409, "Qf1": 1410, "Rd3#": 1411, "Qe5": 1412, "Qxc7": 1413, "Rxc2+": 1414, "N3xe4": 1415, "d4": 1416, "Rxf1+": 1417, "Ndf3": 1418, "Ned5": 1419, "Qxc5": 1420, "Nac6": 1421, "gxf7+": 1422, "R6d2": 1423, "Rxf5": 1424, "gxf4+": 1425, "Ndb8": 1426, "Rfa8": 1427, "Bxe5": 1428, "Rg7+": 1429, "Kd4": 1430, "Rfd1+": 1431, "e8=Q": 1432, "Nxd4+": 1433, "Ned6": 1434, "Reb7+": 1435, "Bf5+": 1436, "fxg4": 1437, "Nxa1": 1438, "R6d3": 1439, "a4+": 1440, "Rgg4": 1441, "dxc3+": 1442, "Qxc4": 1443, "Rhh1": 1444, "R4e7": 1445, "Rhd8": 1446, "N8e6": 1447, "fxg2": 1448, "fxg7": 1449, "f2": 1450, "Nb4+": 1451, "Raxd1": 1452, "Ra5": 1453, "Nh1+": 1454, "Qb5": 1455, "Nfe1": 1456, "Nc8": 1457, "c6+": 1458, "Rxg1+": 1459, "Nce1": 1460, "Nh5": 1461, "a3+": 1462, "Kf4": 1463, "Nc7+": 1464, "Rc1": 1465, "a1=Q": 1466, "Nb8": 1467, "Qh3+": 1468, "dxe6": 1469, "Qd1": 1470, "Rxg2+": 1471, "Re4": 1472, "dxe4": 1473, "Qxh2+": 1474, "Ne8": 1475, "Ngf3": 1476, "Rxd4+": 1477, "Bh4": 1478, "Rd8+": 1479, "Bxc7": 1480, "Rdc6": 1481, "Be7": 1482, "Qc5+": 1483, "R4d2": 1484, "Rfb1": 1485, "Rxb2+": 1486, "Rgd1": 1487, "R7f6": 1488, "Qxb3+": 1489, "R3e2": 1490, "Nxh8": 1491, "Rcd2": 1492, "Qg2+": 1493, "Rh7+": 1494, "g6+": 1495, "Bb7+": 1496, "Bxe3+": 1497, "Rb1+": 1498, "Rh2#": 1499, "Ncxd5": 1500, "Rg4": 1501, "Kg7": 1502, "Rc2": 1503, "Rh5": 1504, "Kxh8": 1505, "Rxb4": 1506, "Rxh3#": 1507, "Qb3+": 1508, "g1=Q": 1509, "Qxa5#": 1510, "Qxa2": 1511, "Nd5": 1512, "Ke7": 1513, "Bb6+": 1514, "R8a7": 1515, "b8=Q": 1516, "Rad8": 1517, "Kd5": 1518, "Ngf5": 1519, "Qxd3": 1520, "Nxe2+": 1521, "Bd6+": 1522, "Kd4+": 1523, "Rbc1": 1524, "Bxh2+": 1525, "Nd4+": 1526, "Raxc8": 1527, "c6": 1528, "Bxa3": 1529, "Nf4": 1530, "Rde2": 1531, "Qxd7+": 1532, "Ref6": 1533, "N4e5": 1534, "e1=Q": 1535, "axb6": 1536, "Qxe4": 1537, "Rxh7+": 1538, "exf3+": 1539, "Nc4+": 1540, "Bb7": 1541, "a1=Q+": 1542, "Qc8+": 1543, "Rff8": 1544, "Nf3": 1545, "Bg3+": 1546, "hxg7": 1547, "Be3+": 1548, "Qhh4": 1549, "Ne1+": 1550, "Nxf4": 1551, "exf7": 1552, "Nxh4": 1553, "R5b2": 1554, "Rdxa7": 1555, "N1h2": 1556, "Kxd5": 1557, "Kxd6": 1558, "Ncb1": 1559, "Naxc4": 1560, "Kc8": 1561, "Qxc2+": 1562, "fxe3": 1563, "Bb5+": 1564, "Nxd7": 1565, "Kxa7": 1566, "Nc2+": 1567, "gxf5": 1568, "Nbc5": 1569, "Rcg7+": 1570, "Qxc7+": 1571, "Rexd5": 1572, "fxg3+": 1573, "Rxd3": 1574, "f3": 1575, "Rxh7": 1576, "Red2": 1577, "Qe2+": 1578, "Rhc8": 1579, "Rad1": 1580, "Bc3": 1581, "cxd5+": 1582, "Nc6": 1583, "Bb1": 1584, "Ng1": 1585, "Bg8": 1586, "Qa5+": 1587, "Rxf8+": 1588, "Rxb3+": 1589, "Be3": 1590, "Kf6+": 1591, "R3e7+": 1592, "R6f4": 1593, "Kb2": 1594, "R3d2": 1595, "Qdd8": 1596, "Nfd2": 1597, "Rf3+": 1598, "Qa3": 1599, "Rfh8": 1600, "Rb4+": 1601, "Rxc8#": 1602, "d6": 1603, "Qxg2+": 1604, "Nbxd4+": 1605, "Nxc5": 1606, "Qb7": 1607, "Qb7+": 1608, "Kxf5": 1609, "Kg5": 1610, "R7xb3": 1611, "exd3": 1612, "dxc7": 1613, "N5f3": 1614, "Re4+": 1615, "Nh4": 1616, "Nxc3": 1617, "Rxf4": 1618, "Nef5+": 1619, "Qa5": 1620, "Bc7+": 1621, "Ba4": 1622, "Rhg7+": 1623, "Ned8": 1624, "R8b2": 1625, "Rf6": 1626, "Qxe5+": 1627, "Nxg8": 1628, "R1f5": 1629, "Nxe6+": 1630, "Nxd8": 1631, "Nbd5": 1632, "Kf5": 1633, "b6": 1634, "Qxb5+": 1635, "Bxa5": 1636, "Na5+": 1637, "Bh7+": 1638, "Nfe3": 1639, "Kh6": 1640, "Rdf2+": 1641, "Kc2": 1642, "Ngf6": 1643, "N2d4": 1644, "Ndxe4": 1645, "Rgf5+": 1646, "Rd7": 1647, "Nf5+": 1648, "Rce1": 1649, "Qxf8#": 1650, "Rexe4": 1651, "N4h5": 1652, "Rxh2": 1653, "exd6": 1654, "Re2+": 1655, "Nbc7": 1656, "fxe4": 1657, "gxh5": 1658, "Qe4+": 1659, "g7+": 1660, "Rfh5": 1661, "Kd8": 1662, "Rb2": 1663, "gxh6+": 1664, "Qf6": 1665, "Ned7": 1666, "cxb3+": 1667, "Kf6": 1668, "Rg3+": 1669, "Rg1": 1670, "Rhh5": 1671, "Kxa6": 1672, "Ke4": 1673, "f4": 1674, "Rxc6+": 1675, "Kxd1": 1676, "g6": 1677, "Rfa1": 1678, "Bxh7": 1679, "Qc7+": 1680, "Bf3": 1681, "N5f6": 1682, "Kxh2": 1683, "Rcb2": 1684, "Nde1": 1685, "Rg7": 1686, "Rxh6": 1687, "Rh4+": 1688, "Bxg5+": 1689, "Ng6": 1690, "Qa8+": 1691, "Rxf7": 1692, "R3b4": 1693, "Be1": 1694, "Rf7+": 1695, "exf6": 1696, "Bxg7+": 1697, "Nh8": 1698, "R4f5": 1699, "Kg3": 1700, "Nc5": 1701, "Kxb3": 1702, "Qxb8": 1703, "Ngxe2": 1704, "Red7": 1705, "Rg2": 1706, "Qxc3+": 1707, "Nxf2+": 1708, "Rfe7": 1709, "Kxe7": 1710, "Qh8#": 1711, "Nh3+": 1712, "Bd4": 1713, "dxc2": 1714, "Qff8#": 1715, "Nd8": 1716, "Nxg1": 1717, "Kxb2": 1718, "Nxe5+": 1719, "Qxh3": 1720, "Qxh5+": 1721, "Qg5": 1722, "R8e4": 1723, "Bxe7": 1724, "R8h2": 1725, "R5e2": 1726, "Qa4+": 1727, "Nfd7": 1728, "Qhh6": 1729, "Qxf2+": 1730, "Qg6": 1731, "Rxh4": 1732, "Nhf4": 1733, "Ne2+": 1734, "Rxf7+": 1735, "Raxc6": 1736, "Kg6": 1737, "Rxg6": 1738, "Bf4": 1739, "Nge7": 1740, "Rdh8": 1741, "Qc5": 1742, "Rgh2": 1743, "Nxa3": 1744, "Ndxe5": 1745, "Rxa8+": 1746, "dxc3": 1747, "R6e5": 1748, "Rce8": 1749, "Rca3": 1750, "Rxb6": 1751, "Ndc5": 1752, "c8=Q+": 1753, "Nac4": 1754, "Nhxg5": 1755, "Qxg6+": 1756, "Ka4": 1757, "Rd1": 1758, "Neg4": 1759, "d8=Q#": 1760, "Bxa6": 1761, "Bf7": 1762, "Rxc2": 1763, "cxb6": 1764, "Ka2": 1765, "Bh5": 1766, "Bxf4+": 1767, "gxh6": 1768, "e7+": 1769, "Nfe6": 1770, "Rxh5": 1771, "R1c6": 1772, "Bxe1": 1773, "Bxd8": 1774, "Rxa4+": 1775, "Qxc1+": 1776, "Ref8": 1777, "Rea7": 1778, "R7e3": 1779, "Kf3": 1780, "Ra2": 1781, "Rh1": 1782, "Rexe6": 1783, "Qxe5": 1784, "Nbc4": 1785, "Kxc2": 1786, "Ree8": 1787, "Rxb7": 1788, "Ne5+": 1789, "bxa6": 1790, "Nxd5": 1791, "Ne4+": 1792, "Rf1+": 1793, "cxd6+": 1794, "Kxf7": 1795, "Nc4": 1796, "Qxd5": 1797, "hxg5+": 1798, "Nh2+": 1799, "Rac8": 1800, "Bxd1": 1801, "Qe3": 1802, "Nxa7": 1803, "Rbf4": 1804, "Ra4": 1805, "Kxc4": 1806, "Bf7+": 1807, "Qf2+": 1808, "Rf4+": 1809, "Rae1+": 1810, "Rdb1": 1811, "Nb2": 1812, "Qg3#": 1813, "c3+": 1814, "b6+": 1815, "exd7": 1816, "Nh7": 1817, "fxg3#": 1818, "Bxf2+": 1819, "Nec6": 1820, "Rab1": 1821, "Nf8": 1822, "Nde4": 1823, "Rxe6+": 1824, "Bd4+": 1825, "Qxg7": 1826, "Qdxb4#": 1827, "Qd5+": 1828, "h4+": 1829, "Raxa2": 1830, "Qxg3+": 1831, "Bxd2+": 1832, "Rh6+": 1833, "Bc6#": 1834, "Ba3+": 1835, "Kxa2": 1836, "Nexg4": 1837, "Neg6": 1838, "Red1": 1839, "Qf4": 1840, "Rxg3": 1841, "cxd4+": 1842, "Rbh8": 1843, "Re6": 1844, "Qg8#": 1845, "Rxa6": 1846, "e1=Q#": 1847, "Nd1": 1848, "h7+": 1849, "Rfd8": 1850, "Rfc2": 1851, "Qh4+": 1852, "Rc8": 1853, "Rff7": 1854, "Ra8+": 1855, "Qxb7+": 1856, "Ng1+": 1857, "Bxe2+": 1858, "Rxh3": 1859, "Qxe1": 1860, "Kxc1": 1861, "Rc3": 1862, "Red8": 1863, "R4xd5": 1864, "N6e7": 1865, "Nxh3": 1866, "Bd1": 1867, "Ra5+": 1868, "Bxg6": 1869, "g7": 1870, "Nh6+": 1871, "d7": 1872, "Bg1+": 1873, "Kc7": 1874, "Rxc5+": 1875, "Rbe1": 1876, "Nxg7": 1877, "Qxe6+": 1878, "Rh2+": 1879, "Rh3+": 1880, "Re3": 1881, "Rac5": 1882, "Rxe2": 1883, "Ra8#": 1884, "Qxe3": 1885, "Bf2+": 1886, "Rfg8": 1887, "g3": 1888, "Nxe3": 1889, "Nf2": 1890, "gxh4": 1891, "Rae4": 1892, "R5e3": 1893, "Ka1": 1894, "Nf3+": 1895, "a4": 1896, "Ncxb1": 1897}